# 데이터 읽고 탐색하기(using `pandas`)

In [1]:
import pandas as pd

In [48]:
df_weather = pd.read_csv('seoul_weather.csv', encoding='cp949', sep=',', index_col=False)
df_weather

,\t\t지점번호,지점명,일시,평균기온(℃),최고기온(℃),\t최고기온시각,최저기온(℃),최저기온시각,일교차
0,108,서울,1907-10-01,13.5,20.7,NaN,7.9,NaN,12.8
1,108,서울,1907-10-02,16.2,22.0,NaN,7.9,NaN,14.1
2,108,서울,1907-10-03,16.2,21.3,NaN,13.1,NaN,8.2
3,108,서울,1907-10-04,16.5,22.0,NaN,11.2,NaN,10.8
4,108,서울,1907-10-05,17.6,25.4,NaN,10.9,NaN,14.5
...,...,...,...,...,...,...,...,...,...
41571,108,서울,2022-09-29,20.4,26.5,16:12,16.4,06:12,10.1
41572,108,서울,2022-09-30,20.7,27.7,15:22,14.8,07:05,12.9
41573,108,서울,2022-10-01,20.9,27.6,13:57,14.4,06:41,13.2
41574,108,서울,2022-10-02,19.4,21.6,13:21,17.2,22:32,4.4
41575,108,서울,2022-10-03,21.4,23.4,20:04,17.5,00:01,5.9

In [49]:
df_weather.count()

\t\t지점번호    41576
지점명         41576
일시          41576
평균기온(℃)     40820
최고기온(℃)     40817
\t최고기온시각    28742
최저기온(℃)     40817
최저기온시각      28732
일교차         40816
dtype: int64

In [50]:
df_weather.head(5)

   \t\t지점번호 지점명          일시  평균기온(℃)  최고기온(℃) \t최고기온시각  최저기온(℃) 최저기온시각   일교차
0       108  서울  1907-10-01     13.5     20.7      NaN      7.9    NaN  12.8
1       108  서울  1907-10-02     16.2     22.0      NaN      7.9    NaN  14.1
2       108  서울  1907-10-03     16.2     21.3      NaN     13.1    NaN   8.2
3       108  서울  1907-10-04     16.5     22.0      NaN     11.2    NaN  10.8
4       108  서울  1907-10-05     17.6     25.4      NaN     10.9    NaN  14.5

In [51]:
df_weather.columns = ['지점번호', '지점명', '일시', '평균기온', '최고기온', '최고기온시각', '최저기온',
       '최저기온시각','일교차']

In [52]:
df_weather.head(5)

   지점번호 지점명          일시  평균기온  최고기온 최고기온시각  최저기온 최저기온시각   일교차
0   108  서울  1907-10-01  13.5  20.7    NaN   7.9    NaN  12.8
1   108  서울  1907-10-02  16.2  22.0    NaN   7.9    NaN  14.1
2   108  서울  1907-10-03  16.2  21.3    NaN  13.1    NaN   8.2
3   108  서울  1907-10-04  16.5  22.0    NaN  11.2    NaN  10.8
4   108  서울  1907-10-05  17.6  25.4    NaN  10.9    NaN  14.5

In [53]:
df_weather['최고기온']

0        20.7
1        22.0
2        21.3
3        22.0
4        25.4
         ...
41571    26.5
41572    27.7
41573    27.6
41574    21.6
41575    23.4
Name: 최고기온, Length: 41576, dtype: float64

In [54]:
# 최고 기온 / 최저 기온
print(df_weather['최고기온'].max())
print(df_weather['최저기온'].min())

39.6
-23.1

### 최고 기온

In [55]:
df_max = df_weather[df_weather['최고기온'] == df_weather['최고기온'].max()]
df_max

       지점번호 지점명          일시  평균기온  최고기온 최고기온시각  최저기온 최저기온시각   일교차
40051   108  서울  2018-08-01  33.6  39.6  15:36  27.8  05:56  11.8

In [65]:
print('역대 최고기온은 {} {}에 기록된 {}도 입니다.'.format(df_max.iloc[0, 2], df_max.iloc[0, 5],df_weather['최고기온'].max()))

역대 최고기온은 2018-08-01 15:36에 기록된 39.6도 입니다.

### 최저 기온

In [57]:
df_min = df_weather[df_weather['최저기온'] == df_weather['최저기온'].min()]
df_min

      지점번호 지점명          일시  평균기온  최고기온 최고기온시각  최저기온 최저기온시각   일교차
7396   108  서울  1927-12-31 -15.3  -6.4    NaN -23.1    NaN  16.7

In [67]:
print('역대 최고기온은 {} {}에 기록된 {}도 입니다.'.format(df_min.iloc[0, 2], df_min.iloc[0, 5],df_weather['최저기온'].min()))

역대 최고기온은 1927-12-31 nan에 기록된 -23.1도 입니다.

### 최고 일교차

In [59]:
df_gap = df_weather[df_weather['일교차'] == df_weather['일교차'].max()]
df_gap

       지점번호 지점명          일시  평균기온  최고기온 최고기온시각  최저기온 최저기온시각   일교차
12619   108  서울  1942-04-19  12.7  24.3  14:12   2.5  06:16  21.8

In [69]:
print('역대 최고기온은 {}에 기록된 {}도 입니다.'.format(df_gap.iloc[0, 2], df_weather['일교차'].max()))

역대 최고기온은 1942-04-19에 기록된 21.8도 입니다.